

//פונקציה שלא מקבלת פרמטרים ולא מחזירה ערך
let f1=()=>{console.log("I am f1")};

f1();



//פונקציה שמקבלת פרמטר אחד ולא מחזירה ערך
let f2=(msg)=>{console.log(`I am f2, msg: ${msg}`)};

f2("Call f2");


// כלל : אם פונקציה מקבלת פרמטר אחד בלבד - אפשר להסיר את הסוגריים של הפרמטרים
//פונקציה שמקבלת פרמטר אחד ולא מחזירה ערך
let f3= msg =>{console.log(`I am f3, msg: ${msg}`)};

f3("Call f3");

//פונקציה שמקבלת שני פרמטרים ולא מחזירה ערך
let f4= (x1,x2) =>{console.log(`I am f4, x1: ${x1}, x2: ${x2}`)};

f4("Call1","call2");



//פונקציה שלא מקבלת פרמטרים ומחזירה ערך
let f5=()=>{return "I am f5"};

console.log(f5());



//return כלל: פונקציה שמכילה בגוף הפונקציה רק פקודה אחת והיא פקודת 
//{return } ניתן להסיר את בחלקים הבאים:
//פונקציה שלא מקבלת פרמטרים ומחזירה ערך
let f6=()=>"I am f6";
console.log(f6());



//פונקציה שמקבלת פרמטר אחד ומחזירה את הריבוע שלו
let f7=(num)=>{return num*num};
console.log(f7(3));

//פונקציה שמקבלת פרמטר אחד ומחזירה את הריבוע שלו
let f8=num=>num*num;
console.log(f8(3));



/*
OUTPUT:
______________________
I am f1
I am f2, msg: Call f2
I am f3, msg: Call f3
I am f4, x1: Call1, x2: call2
I am f5
I am f6
9
9
*/
